## [debugtest](https://daniellem97.app.spacelift.io/stack/debugtest/run/01JNRS0XG47VSG5K1R5GM9KE3F) plan logs

<details>
<summary>Click here to expand</summary>

```
[01JNNFDR99NQTM0BRZJ2FGCX2H] Planning changes with 0 custom hooks...
[01JNNFDR99NQTM0BRZJ2FGCX2H] Running command: sh [-c spacelift-worker env >> /mnt/workspace/.env_hooks_before && terraform plan -input=false -lock=false -out=spacelift.plan && spacelift-worker env >> /mnt/workspace/.env_hooks_after]
[*****mdata.terraform_remote_state.demo-stack-state: Reading...
[*****mdata.terraform_remote_state.demo-stack-state: Read complete after *****s
[*****mdata.aws_ami.server_ami: Reading...
[*****mdata.aws_ami.server_ami: Read complete after *****s [id=ami-09563a*****0670fc573c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

[*****m  # aws_internet_gateway.mtc_internet_gateway will be created
  + resource "aws_internet_gateway" "mtc_internet_gateway" {
      + [*****marn      = (known after apply)
      + [*****mid       = (known after apply)
      + [*****mowner_id = (known after apply)
      + [*****mtags     = {
          + "Name" = "mtc_igw2"
        }
      + [*****mtags_all = {
          + "Name" = "mtc_igw2"
        }
      + [*****mvpc_id   = (known after apply)
    }

[*****m  # aws_route.default_route will be created
  + resource "aws_route" "default_route" {
      + [*****mdestination_cidr_block = "0.0.0.0/0"
      + [*****mgateway_id             = (known after apply)
      + [*****mid                     = (known after apply)
      + [*****minstance_id            = (known after apply)
      + [*****minstance_owner_id      = (known after apply)
      + [*****mnetwork_interface_id   = (known after apply)
      + [*****morigin                 = (known after apply)
      + [*****mroute_table_id         = (known after apply)
      + [*****mstate                  = (known after apply)
    }

[*****m  # aws_route.default_route2 will be created
  + resource "aws_route" "default_route2" {
      + [*****mdestination_cidr_block = "0.0.0.0/0"
      + [*****mgateway_id             = (known after apply)
      + [*****mid                     = (known after apply)
      + [*****minstance_id            = (known after apply)
      + [*****minstance_owner_id      = (known after apply)
      + [*****mnetwork_interface_id   = (known after apply)
      + [*****morigin                 = (known after apply)
      + [*****mroute_table_id         = (known after apply)
      + [*****mstate                  = (known after apply)
    }

[*****m  # aws_route_table.mtc_public_rt will be created
  + resource "aws_route_table" "mtc_public_rt" {
      + [*****marn              = (known after apply)
      + [*****mid               = (known after apply)
      + [*****mowner_id         = (known after apply)
      + [*****mpropagating_vgws = (known after apply)
      + [*****mroute            = (known after apply)
      + [*****mtags             = {
          + "Name" = "dev_public_rt"
        }
      + [*****mtags_all         = {
          + "Name" = "dev_public_rt"
        }
      + [*****mvpc_id           = (known after apply)
    }

[*****m  # aws_route_table_association.mtc_public_assoc will be created
  + resource "aws_route_table_association" "mtc_public_assoc" {
      + [*****mid             = (known after apply)
      + [*****mroute_table_id = (known after apply)
      + [*****msubnet_id      = (known after apply)
    }

[*****m  # aws_security_group.mtc_sg will be created
  + resource "aws_security_group" "mtc_sg" {
      + [*****marn                    = (known after apply)
      + [*****mdescription            = "public security group"
      + [*****megress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-*****"
              + security_groups  = []
              + self             = *****
              + to_port          = 0
            },
        ]
      + [*****mid                     = (known after apply)
      + [*****mingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = *****
              + to_port          = 22
            },
        ]
      + [*****mname                   = "public_sg"
      + [*****mname_prefix            = (known after apply)
      + [*****mowner_id               = (known after apply)
      + [*****mrevoke_rules_on_delete = *****
      + [*****mtags_all               = (known after apply)
      + [*****mvpc_id                 = (known after apply)
    }

[*****m  # aws_subnet.mtc_public_subnet will be created
  + resource "aws_subnet" "mtc_public_subnet" {
      + [*****marn                                            = (known after apply)
      + [*****massign_ipv6_address_on_creation                = *****
      + [*****mavailability_zone                              = (known after apply)
      + [*****mavailability_zone_id                           = (known after apply)
      + [*****mcidr_block                                     = "*****0.*****23.*****.0/24"
      + [*****menable_dns64                                   = *****
      + [*****menable_resource_name_dns_a_record_on_launch    = *****
      + [*****menable_resource_name_dns_aaaa_record_on_launch = *****
      + [*****mid                                             = (known after apply)
      + [*****mipv6_cidr_block_association_id                 = (known after apply)
      + [*****mipv6_native                                    = *****
      + [*****mmap_public_ip_on_launch                        = *****
      + [*****mowner_id                                       = (known after apply)
      + [*****mprivate_dns_hostname_type_on_launch            = (known after apply)
      + [*****mtags                                           = {
          + "Repository" = "new2"
        }
      + [*****mtags_all                                       = {
          + "Repository" = "new2"
        }
      + [*****mvpc_id                                         = (known after apply)
    }

[*****m  # aws_vpc.mtc_vpc will be created
  + resource "aws_vpc" "mtc_vpc" {
      + [*****marn                            = (known after apply)
      + [*****mcidr_block                     = "*****0.*****23.0.0/*****6"
      + [*****mdefault_network_acl_id         = (known after apply)
      + [*****mdefault_route_table_id         = (known after apply)
      + [*****mdefault_security_group_id      = (known after apply)
      + [*****mdhcp_options_id                = (known after apply)
      + [*****menable_classiclink             = (known after apply)
      + [*****menable_classiclink_dns_support = (known after apply)
      + [*****menable_dns_hostnames           = *****
      + [*****menable_dns_support             = *****
      + [*****mid                             = (known after apply)
      + [*****minstance_tenancy               = "default"
      + [*****mipv6_association_id            = (known after apply)
      + [*****mipv6_cidr_block                = (known after apply)
      + [*****m*****_route_table_id            = (known after apply)
      + [*****mowner_id                       = (known after apply)
      + [*****mtags                           = {
          + "Name" = "dev22"
        }
      + [*****mtags_all                       = {
          + "Name" = "dev22"
        }
    }

[*****mPlan: 8 to add, 0 to change, 0 to destroy.

[*****mChanges to Outputs:
  + [*****mdev_ip*****       = "*****3*****"
  + [*****mdev_ip3       = "*****t*****h3"
  + [*****mprojects      = {
      + ***** = {
          + id      = "*****name"
          + id_full = "full_id"
          + number  = "*****2345"
        }
      + *****2 = {
          + id      = "*****2name"
          + id_full = "full_id"
          + number  = "67890"
        }
    }
  + [*****mrandomoutput2 = "dummy"
[01JNNFDR99NQTM0BRZJ2FGCX2H] Changes are GO
[01JNNFDR99NQTM0BRZJ2FGCX2H] Running command: sh [-c terraform show -json]
[01JNNFDR99NQTM0BRZJ2FGCX2H] Uploading the list of managed resources...
[01JNNFDR99NQTM0BRZJ2FGCX2H] Running command: sh [-c terraform show -json "spacelift.plan"]
[01JNNFDR99NQTM0BRZJ2FGCX2H] Generating Infracost JSON report from plan
[01JNNFDR99NQTM0BRZJ2FGCX2H] Running command: sh [-c INFRACOST_SKIP_UPDATE_CHECK=true infracost breakdown --path /tmp/spacelift-plan2064819058 --format=json --log-level=warn]

[01JNNFDR99NQTM0BRZJ2FGCX2H] Infracost report generated successfully
[01JNNFDR99NQTM0BRZJ2FGCX2H] Mapping Infracost data to resources
[01JNNFDR99NQTM0BRZJ2FGCX2H] Costs mapped successfully
[01JNNFDR99NQTM0BRZJ2FGCX2H] Running command: sh [-c terraform output -json]
[01JNNFDR99NQTM0BRZJ2FGCX2H] Please be aware that the run changes calculation includes output changes.
[01JNNFDR99NQTM0BRZJ2FGCX2H] Resource list upload is GO
[01JNNFDR99NQTM0BRZJ2FGCX2H] Generating JSON representation of the plan...
[01JNNFDR99NQTM0BRZJ2FGCX2H] Running command: sh [-c terraform show -json "spacelift.plan"]
[01JNNFDR99NQTM0BRZJ2FGCX2H] JSON representation is GO
[01JNNFDR99NQTM0BRZJ2FGCX2H] Generating Infracost JSON report from plan
[01JNNFDR99NQTM0BRZJ2FGCX2H] Running command: sh [-c INFRACOST_SKIP_UPDATE_CHECK=true infracost breakdown --path spacelift.plan.json --format=json --log-level=warn]

[01JNNFDR99NQTM0BRZJ2FGCX2H] Infracost report generated successfully
[01JNNFDR99NQTM0BRZJ2FGCX2H] Loading custom plan policy inputs...
[01JNNFDR99NQTM0BRZJ2FGCX2H] 0 custom plan policy inputs found
[01JNNFDR99NQTM0BRZJ2FGCX2H] Evaluated 1 plan policy
[01JNNFDR99NQTM0BRZJ2FGCX2H] Plan checks are GO
```

</details>